app/views/sections/index.html.erb

SELECT COUNT(*) FROM `sections`
SELECT `sections`.* FROM `sections`  ORDER BY sections.position ASC
---
  <h2>Sections</h2>
  <div><%= pluralize(@sections.size, 'section') %></div>