app/views/subjects/index.html.erb

SELECT COUNT(*) FROM `subjects`
SELECT `subjects`.* FROM `subjects`  ORDER BY subjects.position ASC
---
  <!-- counts all of the current pages -->
  <div><%= pluralize(@subjects.size, 'subject') %> found </div>

SELECT COUNT(*) FROM `pages` WHERE `pages`.`subject_id` = 1
---
    <!-- defines the number of subjects in the pages table -->
    <td class="center"><%= subject.pages.size %></td>