app/controllers/access_controller.rb

  def attempt_login
    # Check if the params[:username] and params[:password] hash contains a value
    if params[:username].present? && params[:password].present?
      # Next find the user that matches with the submitted user from the params[:username] hash, then store that into our found_user variable
      found_user = AdminUser.where(:username => params[:username]).first
---
SELECT  `admin_users`.* FROM `admin_users` WHERE `admin_users`.`username` = 'PS'  ORDER BY `admin_users`.`id` ASC LIMIT 1