app/controllers/pages_controller.rb

SELECT COUNT(*) FROM `pages`
SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
---
  def new
    # Increment + 1 if user makes a new page
    @page_count = Page.count + 1
    # Access an instance of Subjects, To be passed through our edit template then can be accessed by our partial
    @subjects = Subject.order('position ASC')

SELECT COUNT(*) FROM `pages`
INSERT INTO `pages` (`subject_id`, `name`, `permalink`, `position`, `visible`, `created_at`, `updated_at`) VALUES (3, 'Something', 'something', 5, 1, '2016-07-15 05:57:45', '2016-07-15 05:57:45')
SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
---
  def create
    if params[:page].present? # are values present? if yes continue
      @page = Page.new(page_params)
      if @page.save
        flash[:notice] = "Page Created Successfully"
        redirect_to(:action => "index")
      else
        # If save fails, redisplay the form so user can fix problems render the new form_template
        # if error display reference of number of pages then re render new
        @page_count = Page.count + 1
        @subjects = Subject.order('position ASC')

SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
SELECT COUNT(*) FROM `pages`
---
  def edit
    # Access an instance of Subjects, To be passed through our edit template then can be accessed by our partial
    @subjects = Subject.order('position ASC')
    @page_count = Page.count

SELECT COUNT(*) FROM `pages`
UPDATE `pages` SET `name` = '', `position` = 10, `updated_at` = '2016-07-18 11:26:54' WHERE `pages`.`id` = 6
SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
---
  def update
    # check if page params has a value if so update the values
    if params[:page].present?

      if @page.update_attributes(page_params)
        puts params
        flash[:notice] = "Page Updated Successfully"
        redirect_to(:action => "show", :id => @page.id)
      else
        @subjects = Subject.order('position ASC')

DELETE FROM `pages` WHERE `pages`.`id` = 5
---
  def destroy
    page_name = @page.name
    @page.destroy

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 5 LIMIT 1
---
    def find_page
      @page = Page.find(params[:id])