app/controllers/sections_controller.rb

  def new
    @section = Section.new({:name => "Write a Title"})
    # Increment + 1 if user makes a new page
    @section_count = Section.count + 1
    @pages = Page.order('position ASC')
---
SELECT COUNT(*) FROM `sections`
SELECT `pages`.* FROM `pages`  ORDER BY position ASC

  def create
    if params[:section].present?
      @section = Section.new(section_parameters)
      if @section.save
        flash[:notice] = "Successfully published a new section"
        redirect_to(:action => "index")
      else
        # If error, redisplay form then on submit increment Section.count
        @section_count = Section.count + 1
        @pages = Page.order('position ASC')
---
INSERT INTO `sections` (`page_id`, `name`, `position`, `visible`, `content_type`, `content`, `created_at`, `updated_at`) VALUES (0, 'Youtube Link', 4, 1, 'Link', 'https://www.youtube.com/', '2016-07-15 05:49:09', '2016-07-15 05:49:09')
SELECT COUNT(*) FROM `sections`
SELECT `pages`.* FROM `pages`  ORDER BY position ASC

  def edit
    @pages = Page.order('position ASC')
    @section_count = Section.count
---
SELECT COUNT(*) FROM `pages`
SELECT `pages`.* FROM `pages`  ORDER BY position ASC
SELECT COUNT(*) FROM `sections`

  def update
    #first find the section to update by using our defined before_action "find_section"
    if params[:section].present?

      if @section.update_attributes(section_parameters)
        flash[:notice] = "Successfully updated a new section"
        redirect_to(:action => "show", :id => @section.id)
      else
        @pages = Page.order('position ASC')
        @section_count = Section.count
---
UPDATE `sections` SET `page_id` = 3, `position` = 1, `updated_at` = '2016-07-17 06:08:49' WHERE `sections`.`id` = 4
SELECT `pages`.* FROM `pages`  ORDER BY position ASC
SELECT COUNT(*) FROM `sections`

  def destroy

    # @section = Section.find(params[:id]).destroy
    section_name = @section.name
    @section.destroy
---
DELETE FROM `sections` WHERE `sections`.`id` = 5

    def find_section
      @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 5 LIMIT 1