app/controllers/subjects_controller.rb

SELECT COUNT(*) FROM `subjects`
---
  def new
    # increment subject if user adds new subject
    @subject_count = Subject.count + 1

INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('First Subject', 1, 1, '2016-07-14 01:08:55', '2016-07-14 01:08:55')
SELECT COUNT(*) FROM `subjects`
---
  def create
    # check if subject values from fields are present
    if params[:subject].present?
      # create new subject with mass assignment with subject_params
      @subject = Subject.new(subject_params)
      # Save the object
      if @subject.save
        # If save succeeds, redirect to the index action
        flash[:notice] = "Subject Created Successfully"
        redirect_to(:action => "index")
      else
        # If save fails,render the new form_template
        @subject_count = Subject.count + 1

SELECT COUNT(*) FROM `subjects`
---
  def edit
    # find the subject to edit using find_subject method

    @subject_count = Subject.count

UPDATE `subjects` SET `position` = 1, `created_at` = '2016-07-16 00:00:00', `updated_at` = '2016-07-16 08:43:04' WHERE `subjects`.`id` = 6
SELECT COUNT(*) FROM `subjects`
---
  def update
    # Find the existing Subject using find_subjects method
    # Check if the subject has params
    if params[:subject].present?
    # update existing subject with new values
      if @subject.update_attributes(subject_params)
        flash[:notice] = "Subject Updated Successfully"
        redirect_to(:action => "show" , :id => @subject.id)
        else
          # If update fails, redisplay the form so user can fix problems
          @subject_count = Subject.count

DELETE FROM `subjects` WHERE `subjects`.`id` = 5
---
  def destroy
    # store subject.name so we can print through flash notice
    subject_name = @subject.name
    @subject.destroy

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
---
  def find_subject
    @subject = Subject.find(params[:id])